from typing import List

class Solution:
    def fizzBuzz(self, n: int) -> List[str]:
        # реализовать
        pass


# ============================================
# АЛГОРИТМИЧЕСКАЯ СПРАВКА (для информации, не решение)
# ============================================
# Задача FizzBuzz — классическая, но НЕ имеет O(1) решения, 
# так как нужно сгенерировать n строк (минимум O(n) по выводу).
#
# ✔ Лучшее решение по времени/памяти — O(n) с if-elif-else
#   (два деления на 3 и 5, без хранения лишних массивов).
#
# ✔ "Именной" алгоритм: конкатенация строк (микрооптимизация)
#   result = ""
#   if i % 3 == 0: result += "Fizz"
#   if i % 5 == 0: result += "Buzz"
#   if not result: result = str(i)
#
# ✔ Математической замкнутой формулы нет, так как вывод зависит от i.
#
# Можно использовать словарь делителей, но это замедлит код из-за хэширования.
# Для n <= 10^4 подходит любое простое решение.
# ============================================


def run_tests():
    solution = Solution()
    
    # Тест 1: n = 3
    assert solution.fizzBuzz(3) == ["1", "2", "Fizz"], "Тест 1 провален"
    
    # Тест 2: n = 5
    assert solution.fizzBuzz(5) == ["1","2","Fizz","4","Buzz"], "Тест 2 провален"
    
    # Тест 3: n = 15
    assert solution.fizzBuzz(15) == [
        "1","2","Fizz","4","Buzz","Fizz","7","8","Fizz","Buzz",
        "11","Fizz","13","14","FizzBuzz"
    ], "Тест 3 провален"
    
    print("Все тесты пройдены!")


if __name__ == "__main__":
    run_tests()